{"_id": "3", "title": "", "text": "I'm not saying I don't like the idea of on-the-job training too, but you can't expect the company to do that. Training workers is not their job - they're building software. Perhaps educational systems in the U.S. (or their students) should worry a little about getting marketable skills in exchange for their massive investment in education, rather than getting out with thousands in student debt and then complaining that they aren't qualified to do anything.", "metadata": {}}
{"_id": "31", "title": "", "text": "So nothing preventing false ratings besides additional scrutiny from the market/investors, but there are some newer controls in place to prevent institutions from using them. Under the DFA banks can no longer solely rely on credit ratings as due diligence to buy a financial instrument, so that's a plus. The intent being that if financial institutions do their own leg work then *maybe* they'll figure out that a certain CDO is garbage or not.  Edit: lead in", "metadata": {}}
{"_id": "56", "title": "", "text": "You can never use a health FSA for individual health insurance premiums.  Moreover, FSA plan sponsors can limit what they are will to reimburse.  While you can't use a health FSA for premiums, you could previously use a 125 cafeteria plan to pay premiums, but it had to be a separate election from the health FSA. However, under N. 2013-54, even using a cafeteria plan to pay for indivdiual premiums is effectively prohibited.", "metadata": {}}
{"_id": "59", "title": "", "text": "Samsung created the LCD and other flat screen technology like OLED. a few years ago every flat screen came from Samsung factories and were reshelled. I think the 21 Hanns screen I am looking at now is Samsung and it is only a couple of years old. Samsung seem to be a good company.", "metadata": {}}
{"_id": "63", "title": "", "text": "Here are the SEC requirements: The federal securities laws define the term accredited investor in   Rule 501 of Regulation D as: a bank, insurance company, registered investment company, business development company, or small business investment company; an employee benefit plan, within the meaning of the Employee Retirement Income Security Act, if a bank, insurance company, or   registered investment adviser makes the investment decisions, or if   the plan has total assets in excess of $5 million; a charitable organization, corporation, or partnership with assets exceeding $5 million; a director, executive officer, or general partner of the company selling the securities; a business in which all the equity owners are accredited investors; a natural person who has individual net worth, or joint net worth with the person’s spouse, that exceeds $1 million at the time of the   purchase, excluding the value of the primary residence of such person; a natural person with income exceeding $200,000 in each of the two most recent years or joint income with a spouse exceeding $300,000 for   those years and a reasonable expectation of the same income level in   the current year; or a trust with assets in excess of $5 million, not formed to acquire the securities offered, whose purchases a sophisticated person makes. No citizenship/residency requirements.", "metadata": {}}
{"_id": "100", "title": "", "text": "\"Only relevant to those with fantasy economy teams. Seriously, Rand's fictional works never translate well into reality because, no matter how hard people try, that \"\"fiction\"\" element just can't be ignored.  Test it yourself: Strip John Galt and his followers of everything they have which was created by or within the \"\"society\"\" they so revile, drop them in the desert -- and they'll all be dead of exposure and starvation in less than two weeks because they will be naked, without tools and without food.  The only reason the libertarians get away with pushing their tripe as a rational philosophy is because no one will point out what it is wrong with their thinking. Why? Well, for most of my lifetime, their \"\"philosophy\"\" was considered nuttery in line with the John Birchers and so why bother. It's only with the ascendency of these billionaire-funded politicians that this crap thinking has become acceptable, and even then, only to them.\"", "metadata": {}}
{"_id": "108", "title": "", "text": "Futures contracts are a member of a larger class of financial assets called derivatives. Derivatives are called such because their payoffs depend on the price of other assets (financial or real). Other kinds of derivatives are call options, put options. Fixed income assets that mimic the behavior of derivatives are callable bonds, puttable bonds etc.  A futures contract is a contract that specifies the following: Just like with any other contract, there are two parties involved. One party commits to delivering the underlying asset to the other party on expiration date in exchange for the futures price. The other party commits to paying the futures price in exchange for the asset. There is no price that any of the two parties pay upfront to engage in the contract. The language used is so that the agent committing to receiving the delivery of the underlying asset is said to have bought the contract. The agent that commits to make the delivery is said to have sold the contract.  So answer your question, buying on June 1 a futures contract at the futures price of $100, with a maturity date on August 1 means you commit to paying $100 for the underlying asset on August 1. You don't have to pay anything upfront. Futures price is simply what the contract prescribes the underlying asset will exchange hands for.", "metadata": {}}
{"_id": "125", "title": "", "text": "This month when you join Scentsy you get a free defuser with your kit!   This has never been done before.  You also get spring / summer and Fall / Winter testers plus all your kit items!    Be your own boss!  You choose what hours you work, when and where you work them.   Join my Scentsy family today!  [Amanda C. Robar Scentsy Business ](http://www.amandacrobar.scentsy.ca)", "metadata": {}}
{"_id": "132", "title": "", "text": "Whenever you pay or withdraw some fund from your account, paypal takes approx 3% of the current currency value along with the fees. i.e. If you are paying/withdraw 100 unit of US Dollars to British pounds and if the current convertion rate is 1$=0.82GBP, then consider reducing 3% of the actual currency rate. So, the approximate magnitude will be 0.82*97% (100-3=97) = 0.7954. So, 1$=0.7954GBP. This formula will not give you 100% accurate value but will help of course. Captain", "metadata": {}}
{"_id": "138", "title": "", "text": "So you asked him in 2010 how he was gong to compete with DVD rental distributors like Netflix (which is what Netflix primarily was at the time) and Lovefilm and you were surprised that he was he said they were going to continue to compete as a DVD rental distributor just like the mentioned competitors?", "metadata": {}}
{"_id": "158", "title": "", "text": "In the US, I would say the risk is exactly the same.  If your accounts are withing the FDIC amount (currently $250,000) your balance is 100% covered in case of a failure. You are giving up a larger network of ATMs in some cases.  You are also perhaps giving up the number of branches you can visit, the hours the bank is open and maybe how well the website works.  The features might be less, but the protection for your deposits is the same.", "metadata": {}}
{"_id": "164", "title": "", "text": "I don't know what the fee is, I just made up $5 as an example. It doesn't surprise me at all that Comcast is charging $20.  I don't really mind that I don't have on demand, it doesn't bother me. But after the disaster that CableCards were, there was no chance that tru2way was going to work if the industry had any say in it. They forced the failure of CableCards, and none of their reasons for opposing them went away.", "metadata": {}}
{"_id": "178", "title": "", "text": "\"At any given moment, one can tally the numbers used for NAV. It's math, and little more. The Market Cap, which as you understand is a result of share value. Share value (stock price) is what the market will pay today for the shares. It's not only based on NAV today, but on future expectations. And expectations aren't the same for each of us. Which is why there are always sellers for the buyers of a stock, and vice-versa.  From your question, we agree that NAV can be measured, it's the result of adding up things that are all known. (For now, let's ignore things such as \"\"goodwill.\"\") Rarely is a stock price simply equal to the NAV divided by the number of shares. Often, it's quite higher. The simplest way to look at it is that the stock price not only reflects the NAV, but investors' expectations looking into the future.  If you look for two companies with identical NAV per share but quite different share prices, you'll see that the companies differ in that one might be a high growth company, the other, a solid one but with a market that's not in such a growth mode.\"", "metadata": {}}
{"_id": "180", "title": "", "text": "Chinese suppliers can quote their price in CNY rather than USD (as has been typical), and thus avoid the exchange risk from US dollar volatility- the CNY has been generally appreciating so committing to receive payments in US dollars when their costs are in CNY means they are typically on the losing end of the equation and they have to pad their prices a bit.  Canadian importers will have to buy RMB (typically with CAD) to pay for their orders and Canadian exporters can take payment in RMB if they wish, or set prices in CAD. By avoiding the US dollar middleman the transactions are made less risky and incur less costs. Japan did this many decades ago (they, too, used to price their products in USD).  This is important in transactions of large amounts, not so much for the tiny amounts associated with tourism. Two-way annual trade between China and Canada is in excess of $70bn.  Of course Forex trading may greatly exceed the actual amounts required for trade- the world Forex market is at least an order of magnitude greater than size of real international trade. All that trading in currency and financial instruments means more jobs on Bay Street and more money flowing into a very vital part of the Canadian economy.  Recent article from the (liberal) Toronto Star here.", "metadata": {}}
{"_id": "222", "title": "", "text": "\"I read the post.  I read what **they said** about it.   Yet, that part makes **no sense**.  They keep talking about \"\"only avilable to members of the Florida Bar\"\" but stop and think about how that doesn't make sense.  Are they in a *florida* court or in a *federal* court?  Or an IP/administrative setting?    Some things they wrote suggests they're in a *federal* court.  But others things suggest they're in an administrative court related to IP.  For example, they talk about needing an attorney who can represent them in the Trademark/IP courts.  That sounds like patent prosecution - but that's typically just about getting the patent/IP stuff in the first place - and not so much after-the-fact stuff.  But then again, I'm not at all familiar with the area so I could be way off base.  The problem is: I shouldn't have to be speculating so much because their story sucked.  But patent litigation (for infringement for example) as far as I was aware, occurs in traditional district courts and so far as I am aware you don't need a special trademark/ip exam to sue on it.  By contrast, patent *prosecution*, which is getting a patent through the offices, requires that the attorney take the USPTO exam - to become a 'patent' attorney.  [link](http://en.wikipedia.org/wiki/USPTO_registration_examination).  Federal courts, if that's where they are, typically use PACER ECF/CM (case management web portal).  Which, I'll have to assume is the system they are referring to.  https://www.pacer.gov/psco/cgi-bin/regform.pl  That's where anyone can fucking sign up for it.  Then they can look at dockets and all that jazz.  Maybe there's another system I'm not familiar with OR another system that I can't discern from the way they wrote the story.  But so far.  More BS or just confusing or wrong information.  This is why they should have hired a lawyer.\"", "metadata": {}}
{"_id": "225", "title": "", "text": "&gt; monopoly  &gt; names 3 giant companies who compete with each other in almost every industry possible  What happened to /economy :(. It used to be actual business minded people, now it's becoming another socialist echo chamber... Sad to see.", "metadata": {}}
{"_id": "239", "title": "", "text": "What happens would depend on company culture.  At the very least they could pass it on to their manager.  Or maybe the company just pays support staff by number of answered emails in which case you get the quickest pre-canned answer they can provide.  But the net effect is they will continue to lose to alternatives because of this issue.  They have been given customer feedback.  And their culture is to ignore it.  The results are self inflicted.", "metadata": {}}
{"_id": "264", "title": "", "text": "We write them off as cheap knock offs because that's what they are. They are no match when they come up against the superior technology of the US and her allies - they are only a threat when these countries use them against their own people to stifle dissent.", "metadata": {}}
{"_id": "277", "title": "", "text": "My super fund and I would say many other funds give you one free switch of strategies per year.  Some suggest you should change from high growth option to a more balance option once you are say about 10 to 15 years from retirement, and then change to a more capital guaranteed option a few years from retirement. This is a more passive approach and has benefits as well as disadvantages. The benefit is that there is not much work involved, you just change your investment option based on your life stage, 2 to 3 times during your lifetime. This allows you to take more risk when you are young to aim for higher returns, take a balanced approach with moderate risk and returns during the middle part of your working life, and take less risk with lower returns (above inflation) during the latter part of your working life. A possible disadvantage of this strategy is you may be in the higher risk/ higher growth option during a market correction and then change to a more balanced option just when the market starts to pick up again. So your funds will be hit with large losses whilst the market is in retreat and just when things look to be getting better you change to a more balanced portfolio and miss out on the big gains. A second more active approach would be to track the market and change investment option as the market changes. One approach which shouldn't take much time is to track the index such as the ASX200 (if you investment option is mainly invested in the Australian stock market) with a 200 day Simple Moving Average (SMA). The concept is that if the index crosses above the 200 day SMA the market is bullish and if it crosses below it is bearish. See the chart below:  This strategy will work well when the market is trending up or down but not very well when the market is going sideways, as you will be changing from aggressive to balanced and back too often. Possibly a more appropriate option would be a combination of the two. Use the first passive approach to change investment option from aggressive to balanced to capital guaranteed with your life stages, however use the second active approach to time the change. For example, if you were say in your late 40s now and were looking to change from aggressive to balanced in the near future, you could wait until the ASX200 crosses below the 200 day SMA before making the change. This way you could capture the majority of the uptrend (which could go on for years) before changing from the high growth/aggressive option to the balanced option. If you where after more control over your superannuation assets another option open to you is to start a SMSF, however I would recommend having at least $300K to $400K in assets before starting a SMSF, or else the annual costs would be too high as a percentage of your total super assets.", "metadata": {}}
{"_id": "288", "title": "", "text": "\"&gt; You do realize that investors are protected from being sued right?  Not usually, no. If the investor is a partner in the company then they're just as responsible for the debts of their business as any other partner. If they're just a capital investor with no interest in the company business then sure - you can't sue them. But then my contract wouldn't be with them, would it?  &gt; So if the company you work for tanks, you can sue them, but they don't have any money so what do you expect to get?  The registered owners of the company can also be held liable for it's debts if it's a corporation. Or you can always just have them sign as guarantor for your back pay.  And don't say \"\"Nobody will ever do that!!\"\", because if your service is valuable enough then **YES THEY WILL**. I've pushed for a personal liability guarantee from a company owner before and got it.\"", "metadata": {}}
{"_id": "289", "title": "", "text": "\"So you're basically saying that average market fluctuations have an affect on individual stocks, because individual stocks are often priced in relation to the growth of the market as a whole?  Also, what kinds of investments would be considered \"\"risk free\"\" in this nomenclature?\"", "metadata": {}}
{"_id": "294", "title": "", "text": "US government bonds are where money goes when the markets are turbulent and investors are fleeing from risk, and that applies even if the risk is a downgrade of the US credit rating, because there's simply nowhere else to put your money if you're in search of safety. Most AAA-rated governments have good credit ratings because they don't borrow much money (and most of them also have fairly small economies compared with the US), meaning that there's poor liquidity in their scarce bonds.", "metadata": {}}
{"_id": "297", "title": "", "text": "Nonsense. In places where people have most kids, it doesn't matter how expensive baby care products are because most babies are born where they aren't used nearly as much, or at all. Sure, making them more expensive will help having less children in the first world, but that would change squat WRT the total number.", "metadata": {}}
{"_id": "302", "title": "", "text": "Either way the govt is going to get to a breaking point and it's going to be shitty and miserable until they get there (and obviously when they get there it will get worse before it gets better). This bond trade just prolongs the shitty/miserableness even longer. Who knows how many more people will die from govt sponsored thugs and hunger because this trade pushed the breaking point out a few months/years?", "metadata": {}}
{"_id": "316", "title": "", "text": "Yeah, I instinctively knew that the Middle East probably wouldn't be it, even without knowing jack about finance. So, Europe-wise, we're looking at Frankfurt and London, then?   As for Asia, what about Hong Kong? Given that it is already becoming a center for instrumentation between different financial systems and its close proximity to Southeast Asia (also, it is part of the PRC allowing for direct access to China, yet doesn't operate according to the same restrictions that Shanghai would under the Two Countries, One System deal), do you see that as a future major hub for Islamic finance? Or will it all be crowded into Singapore?", "metadata": {}}
{"_id": "330", "title": "", "text": "\"As long as the losing business is not considered \"\"passive activity\"\" or \"\"hobby\"\", then yes. Passive Activity is an activity where you do not have to actively do anything to generate income. For example - royalties or rentals. Hobby is an activity that doesn't generate profit. Generally, if your business doesn't consistently generate profit (the IRS looks at 3 out of the last 5 years), it may be characterized as hobby. For hobby, loss deduction is limited by the hobby income and the 2% AGI threshold.\"", "metadata": {}}
{"_id": "339", "title": "", "text": "No no - Casual dining restaurants have a business model that is increasingly obsolete, and rather than trying to adapt to changing market conditions, they're just blaming those dang kids.  Sorry, but it's the market - if your product is bad, you won't succeed. Blame the market all you want, but it won't make a shred of difference.", "metadata": {}}
{"_id": "343", "title": "", "text": "The only reason I can think of would be if you were convinced that you couldn't hold on to your money. Treasury Bonds are often viewed as very safe investments, and often used in some situations where cash isn't appropriate.. Also, they typically have a somewhat patriotic theme, helping your country to grow. In addition, many people don't really pay attention to the rate of the bonds, but are just investing in them. The more people investing in them, the lower the yields become. But the bottom line is, I would invest in a savings account any day over a negative interest rate... And it looks like I'm in good company as well, a quick study of reports seems to indicate that these are a very bad investment...", "metadata": {}}
{"_id": "357", "title": "", "text": "I'm in both markets and there are a lot of factors.  Distribution costs in NY are ridiculously high.   Different states have different generation mixes, access to fuel, different regulatory costs, different taxes, different availability of green/renewable energy as well as different mandates, different types of restructuring (TX is fully restructured; NY was only partially restructured and the market has been a total mess -- they're thinking about going back to a fully-regulated model).   For business customers, my biggest pieces of advice are:  1. Energy Audits and, if applicable, reviews of your processes/equipment/whatever to ensure you're not using unnecessary energy or causing unnecessary peaks in demand; 2. Do not sign exclusivity/letter of authorization/power of attorney with a broker -- see what prices they can get you, and then shop around yourself, and if you go through a broker, make sure they tell you as part of the contract how much the supplier is paying them per kWh/therm; 3. Review your usage history (including demand) for at least the past 12 months and then compare to the utility tariff you're being served under -- do anything possible to avoid demand charges and make damn sure you're utility hasn't put you/left you in a demand charge-carrying class if you don't actually qualify for it.  I'll be happy to share more if anyone is interested.", "metadata": {}}
{"_id": "396", "title": "", "text": "First, to answer the question.  The benefit of a 401k is that you don't have to pay income tax on the money contributed nor do you pay capital gains tax on the money that accumulates.  You get that with the restriction that you can't willy nilly remove and contribute money to the account (and you are taxed on withdrawals, more severely if you do it before you are 65).  Similar sorts of restrictions apply to all retirement accounts which give tax benefits.  Now, for the 7000 not providing benefit.  Assuming a very modest 4% growth, over 40 years 7000 becomes 34,671. Not something to sneeze at (inflation, risk reward, blah, blah, blah, it is less than it looks, but 4% is really pretty low, the stock market averages anywhere from 7-&gt;10% and IIRC the bond market is somewhere around 5%).  Now, certainly, to avoid bankruptcy you should withdraw.  However, if it is possible, you will be best served by keeping the money in your 401k account.  The penalties and lost earning opportunities are pretty significant.  /u/BeatArmy99 [has the numbers](http://www.reddit.com/r/finance/comments/2ct0qy/why_cant_i_access_my_401k_if_its_my_money/cjiorl7) for how much you lose by doing an early withdraw.  Don't do this lightly and I would suggest avoiding cashing out the whole thing if you can.", "metadata": {}}
{"_id": "402", "title": "", "text": "\"the truth from the 'horse mouth\"\" - and no he's NOT alt-right, as he's painted by political interests from all sides....  Well, updates and flashnews: 1. Google pontificating on diversity and women's equality: Sergei Brin divorced after cheating on his high achieving brilliant wife with a junior staffer. Guess who left the company after it was found out? 2. Eric Schmidt - rumour has it he likes to \"\"party\"\" - a lot! Good that Google \"\"leadership\"\" is keeping silent on this issue.  2. Diversity and equality.....https://www.theguardian.com/technology/2017/aug/08/google-women-discrimination-class-action-lawsuit  So they are definitely NOT putting their money where their mouth is....  Alt-right are not nice, and often come across as plain stupid. At least they don't reek of this putrid Tartuffe-esque hypocrisy like they left wing counterparts.\"", "metadata": {}}
{"_id": "412", "title": "", "text": "The details of the 401(k) are critical to the decision. A high cost (the expenses charged within the) 401(k) - I would deposit only to the match, and I'd be sure to get the entire match offered. In which case, that $3000 might be good to have available if you start out with a tight budget.  Low cost 401(k) w/match - a no-brainer, deposit what you can afford. Roth 401(k) w/match - same rules for expenses apply, with the added note to use Roth when getting started and in a lower bracket.  Yes, it makes sense to have both.  You should note, depositing to the Roth now is riskless. The account, not the investment. If you decide next year you didn't want it, you can withdraw the deposit with no penalty or tax. Edit to respond to updated question - there are two pieces to the Roth deposit issue. The deposit itself, which puts the $3000 earned income into tax sheltered account, and the choice to invest. These two are sequential and you can take your time in between. I'm not sure what you mean by the dividend timing. In an IRA or 401(k) the dividend isn't taxed, so it's a non-issue. In a cash account, you might quickly have a small tax issue, but this doesn't come into the picture in the tax deferred accounts.", "metadata": {}}
{"_id": "417", "title": "", "text": "Depending on what state you live in in the United States, your Canadian brokerage may be able to sell products within the existing RRSP.  I have an RRSP in Canada through TD Waterhouse and they infact just sent me a recent letter explaining that they are permitted to service my Canadian RRSP under the laws of Tennessee (where I live).  The note went on to specifically state that they are not subject to the broker-dealer regulations of the US or the securities/regulations laws on the TN securities act.  Furthermore, they state that Canadian RRSPs are not regulated under the securities laws of the US and the securities offered and sold to Canadian plans are exempt from registration with the SEC.  When I call TD to do trades, I just ask for a Canada/US broker and that's who enters the sale for me.  I declare my RRSP annually both to IRS under RRSP treaty and through FBAR reporting.", "metadata": {}}
{"_id": "425", "title": "", "text": "Various networking Companies use 192.168.0.1 IP address to access their admin page. We solve issues related to this IP address such as 192.168.0.1 login my account issue, 192.168.0.1 the page cannot be displayed etc. Feel free to contact us through live chat window.", "metadata": {}}
{"_id": "433", "title": "", "text": "It seems like their main problem is not hiring - clearly they've hired some bright technical people.  It just seems like the iPhone and Android came along and management refused to admit that the new platforms were going to compete with the Blackberry and its ecosystem.", "metadata": {}}
{"_id": "438", "title": "", "text": "Best job you could get was working for the government.  Pension isn't as good now, but they still have one. And your healthcare is covered.  Sacrifice some money while working to pay into those things.  Won't be rich, but you'll be far from poor.  And can live a satisfying life even if you are sole income for household.  If you have a spouse that works, you are fucking set.", "metadata": {}}
{"_id": "441", "title": "", "text": "\"Ya it definitely helps, however it's not a must.  Being a good leader is more about getting the right team together than being a visionary in technology or something of that sort. I think understanding technology is on the \"\"wants\"\" side of the equation, not the \"\"needs\"\" for when it comes to a great CEO, that's why the team aspect is what matters most in my mind. A great CEO will build a strong team around him or her and fill in for any missing skillsets he or she is lacking.\"", "metadata": {}}
{"_id": "455", "title": "", "text": "I was actually thinking of doing both, I already have a one sided card, I was thinking of doing an additional 2 sided, however, the single sided that I already have is more of a networking/advertising card that I post in random locations, and the new one will be my business contact card, maybe I will end up with three designs. Thanks for your tips!", "metadata": {}}
{"_id": "462", "title": "", "text": "Hmmmm, 1 or 2, yeah, maybe they were not a good fit for one reason or another. but 5?? Really, you gotta start thinking that maybe, just maybe, there's a chance that's Trump's the problem. #justsayin'  is all.", "metadata": {}}
{"_id": "470", "title": "", "text": "\"Based on the conversations in the comments, I believe a pragmatic solution would be the best immediate course of action, while still working on the long term addiction issues. The first step is to get your husband to agree to give you all of his credit cards and let you manage the money for a set period of time, say 3 months, to see how it goes. (In my experience people are more likely to agree to being uncomfortable for a finite period of time, rather than indefinitely.) Step 2 is to provide him a means for making purchases on his own, but with a limited budget. Here are some examples: Perhaps a combination of the above options would work best. Another thing to consider is to set up alerts with your bank so that you are notified of certain purchases (or all) that are made by your husband. This varies by bank, but nowadays most will allow you to receive text/email immediately when the purchase happens, and can be set to certain amounts or categories. There is a definite psychological difference between, \"\"If I buy this, my spouse will find out at the end of the month and berate me.\"\" and \"\"If I buy this, my spouse is going to run in here in 30 seconds and berate me.\"\" The latter might actually be a deterrent on its own, and you may likely have the opportunity to undo the purchase if you wish to. As a side note, it's important to realize that the above suggestions are still allowing for some limited amount of enabling and temptation to occur. If the addiction is such that it is hazardous to one's health (for example drugs or alcohol addiction), then I don't believe this would be the best course of action. These suggestions are based on my impression that the biggest concern at the moment is financial, and I believe these ideas help to mitigate that. Good luck.\"", "metadata": {}}
{"_id": "475", "title": "", "text": "\"I just can't come around to calling it \"\"taking advantage of\"\" when the means to act on them was put into existence knowingly. It's like saying you took advantage of the highway by travelling at, and not less than, the posted speed limit.\"", "metadata": {}}
{"_id": "478", "title": "", "text": "I suspect this is done at least in part in response to [this review by Edmunds](http://www.edmunds.com/tesla/model-s/2013/long-term-road-test/wrap-up.html) and a [similar one by Consumer Reports](http://www.consumerreports.org/cro/news/2014/08/consumer-reports-tesla-model-s-has-more-than-its-share-of-problems/index.htm) where they describe the number of problems Tesla had over 1 year of ownership.  Esp in the Edmunds review, if you scroll down part way down the article, you'll see the number of powertrain part replacements that were done; it's quite substantial.", "metadata": {}}
{"_id": "530", "title": "", "text": "Public companies sometimes buy up all their shares in order to go private^(1).  Is that the sort of thing you're talking about?  If so, [this article](http://www.investopedia.com/articles/stocks/08/public-companies-privatize-go-private.asp) might be of interest to you.  ^(1) Actually, most of the time, they partner with private equity firms to do it, but I think the effect is essentially what you're describing.", "metadata": {}}
{"_id": "534", "title": "", "text": "Nah I just don't believe anything I see on TV or read on the internet. Anyone can go onto www.imrightyourewrong.com and find whatever data supports they're argument. It's one big echo chamber and you're just some douchebag yankee squawking away behind his phone yammering about how dumb the rest of the world is and wondering why your welfare and wic hasn't arrived this month yet", "metadata": {}}
{"_id": "536", "title": "", "text": "Agreed, this article is crap.  I have no problem with venture capitalists.  They give you the oppurtunity to attian: the capital, the tools, the hardware/software, the knowledge systems, the networking and right talent to work with for your innovation. I'll take that and burn through their capital, than use my own capital and lose it all.", "metadata": {}}
{"_id": "548", "title": "", "text": "In order to do this, you would need to purchase an Amazon gift card from another online vendor that accepts PayPal and then use the Amazon gift card on the Amazon site. There are dozens (if not hundreds) of sites that sell Amazon gift cards online that accept PayPal.", "metadata": {}}
{"_id": "589", "title": "", "text": "So does a post-dated check have any valid use in a business or   personal transaction? Does it provide any financial or legal   protections at all? Yes, most definitely. You're writing a future date on the check, not past, to ensure that the check will not be deposited before that day. Keep in mind that this may change from place to place, since not every country has the same rules. In the US, for example, such trick would not work since the check may be presented any time and is not a limited obligation. However, in some other countries banks will not pay a check presented before the date written on it. While in the US the date on the check is the date on which it was (supposedly) written and as such is meaningless for obligation purposes, in many other countries the date on the check is the date on which the payment to be made, thus constitutes the start of the commitment and payment will not be made before that date. For example, in Canada: If you write a post-dated cheque, under the clearing rules of the   Canadian Payments Association (CPA), your cheque should not be cashed   before the date that is written on it. If the post-dated cheque is cashed early, you can ask your financial   institution to put the money back into your account up to the day   before the cheque should have been cashed.", "metadata": {}}
{"_id": "593", "title": "", "text": "\"Insurance companies on average make money by selling insurance, which   means you lose money on average by dealing with them. The insurance is not gambling where the house always wins. This expression is literal in gambling, because that's how they set the odds. Insurance isn't necessarily similar. Example. Suppose there's 10% chance that $10,000 the boat sinks due to a defect. So, on average your loss is going to be $1,000. The variability of your loss measured as its standard deviation is $2,846. The variability of loss is a measure of risk. Now, let's look at two $10,000 boats. There's 1% chance that they both sink, and 18% chance that only one of them sinks. So, the expected loss is, unsurprisingly, $2,000. However, the variability of expected loss is $3,842, not quite twice the risk (variability) of a single boat accident. If you imagine that instead of a couple of boats the insurance has 100 boats, the variability of their loss (hence their risk) will increase only by a factor of 10, not 100 compared to a single boat. This means that their risk in relative terms is smaller than yours, the individual insurer's.  What I tried to show was that it is possible to both of you and the insurer to benefit from the arrangement. It doesn't mean that it happens in every case, but generally it does. That's why in actuarial science there's a term fair price. UPDATE I was trying to avoid talking about utility here, because it's an involved subject, but you're dragging the discussion in this direction :) You're right that expected value cannot explain the insurance. The reason is that there's another concept that's necessary in addition to the objective measures such as expected value and risk: I mean the utility function or risk-aversion. So, in short you need to maximize expected utility, not the expected payout. Here's a toy example with the same boat. Assume that insurance is $150, and they pay the entire boat's value in case of accident, i.e. $10,000. You're given two choices effectively. At the end of the year, you have either of the following: You're right that the expected value in the second option can be higher in the second option. Let's say the probability of the loss is 10%, in this case the expected value would $9,900, which is higher than certain value of option 1. Why then some people choose option 2? The reason is that we don't maximize the expected payout, but we maximize the utility, according to modern microeconomics and game theory.  Utility is some kind of an function that reflects your preference given the uncertain choices. Every person has their own preferences, and utility function.  Let's say that yours is exponential with a=10000. In this case we can calculate the expected utility as follows: The math works out in such a way that it accounts for your risk tolerance. Depending on how much you love or hate risk, your expected utilities for these option will come out differently. For this given toy example it turned out that the expected utility is higher with insurance, so this person should get it. However, for different values of a parameter \"\"a\"\" in the function, it may not make a sense to insure. Some people are risk averse, some are risk lovers in certain situations. That's the reason why given the same options we make different choices. You may say that you don't value certainty enough to buy this insurance. The bottom line is that nobody can tell you that you're wrong to not buy an insurance. If your risk tolerance is high it may not make a sense for you. Having said this all, I must note that sometimes the society doesn't accept your preferences and utility function. Yes, you tell me today that you accept the risk, but tomorrow when the boat sinks you may come to me and say that you can't pay the student loan because of the hardship. That's the reason why it's mandatory to get liability insurance on cars, for instance.\"", "metadata": {}}
{"_id": "617", "title": "", "text": "\"I think you should evaluate the value of these so-called \"\"penny auction\"\" websites very carefully.  Going to a random site, madbid .com, (which is British with UK prices, but it works just the same with US prices) they claim that someone has bought an iPod Touch 64GB for £21.18. It is £249 directly from Apple. Sold for £21.18 means there were 2118 \"\"bids\"\". I'd have to log in to their site to find the cost of a \"\"bid\"\" for packages, but you can multiply the cost of a single \"\"bid\"\" by 2,118, add another £21.18, and you'll know what all \"\"bidders\"\" trying to receive this item paid - I'll bet the total is substantially more than £249.  People taking part in these scams obviously convince themselves that they are the \"\"clever\"\" ones who will get an item cheaply. Apart from the possibility that a single \"\"bidder\"\" can easily make more bids than the value of the item, if you think you are more clever than everyone else, you are kidding yourself. (If you think you are indeed more clever than everyone else, go ahead and donate your money to these companies).  The \"\"packages\"\" are most likely designed to give you the false impression that you get some value for money. Years ago when I checked a single bid was £1, but in bigger packages the bids would cost say 50 pence. They also want many bidders to make sure the number of bids will be high (although there is nothing other than the website's honesty that prevents them from automatically adding bids if an item would otherwise sell too cheap).  Just to clarify: These are not auction sites. In an auction, the highest bidder pays the price they bid, usually plus some commission (on eBay, the commission is paid by the seller), and gets the goods, while everyone else keeps their money. In this \"\"auction\"\", every bid costs money, and by increasing the bid by one penny each time they make sure there are usually thousands of bids. (They also offer the products at a \"\"reduced\"\" price if you don't \"\"win\"\" the auction; the reduced price is substantially higher than buying from the manufacturer or any reputable retailer directly).\"", "metadata": {}}
{"_id": "628", "title": "", "text": "I will be messaging you on [**2017-10-06 17:57:23 UTC**](http://www.wolframalpha.com/input/?i=2017-10-06 17:57:23 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/finance/comments/7354iz/roku_ipo_stock_price_closes_up_67_on_first_day_of/dnolw5y)  [**3 OTHERS CLICKED THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=[https://www.reddit.com/r/finance/comments/7354iz/roku_ipo_stock_price_closes_up_67_on_first_day_of/dnolw5y]%0A%0ARemindMe!  1 week) to send a PM to also be reminded and to reduce spam.  ^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete Comment&amp;message=Delete! dnolwn7)  _____  |[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List Of Reminders&amp;message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&amp;subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/) |-|-|-|-|-|-|", "metadata": {}}
{"_id": "635", "title": "", "text": "It is amazing to see the fantastic customer service offered by our carpet rug and upholstery cleaners who make sure that the customer pleased. If emergency cleaning need arises, they respond quickly. In Bermon Carpet Cleaning cleaners use only the safest environmentally friendly materials, biodegradable and non toxic cleaning agents to deep clean all types of carpets. Our goal is simple, to provide the highest quality cleaning tailored around our customers’ needs. For any additional information please contact us.", "metadata": {}}
{"_id": "640", "title": "", "text": "Lol...going on a real tangent here, but  why not.  1st: Do we send them aid? If so is it food, currency, or something else? Food MIGHT make sense as long as we are making sure it goes to people who are literally starving (and it doesn't get withheld by the government), currency would most likely not make sense because it would just directly support the regime. In the long run though, respecting property rights wouldn't hurt them at all and could only help, but they have many other issues in that country that need to be fixed as well. The whole reason I brought up the example of Zimbabwe is because Mugabe confiscated the lands of all white ppl (this was a pretty populist policy), who tended to be farmers, gave it to his cronies, and then because the land wasn't being farmed a famine and hyperinflation ensued.", "metadata": {}}
{"_id": "643", "title": "", "text": "\"This is the best tl;dr I could make, [original](https://www.richmondfed.org/publications/research/econ_focus/2016/q3-4/profession) reduced by 88%. (I'm a bot) ***** &gt; A 2014 working paper by several German and Swiss researchers, &amp;quot;Happiness of Economists,&amp;quot; concluded on the basis of a large-scale survey that economists are &amp;quot;Highly happy with life&amp;quot;; moreover, those in North America are the happiest.  &gt; If working as an economist is so much fun, why do they retire at all? Although mandatory retirement at age 70 was once nearly universal in universities, where most research economists are employed, Congress abolished mandatory retirement for faculty starting in 1994.  &gt; Even if a retired economist no longer participates in the profession in any form - no research, no writing, no consulting, no advising students - he or she may well continue to be an economist.   ***** [**Extended Summary**](http://np.reddit.com/r/autotldr/comments/6zjx0h/do_economists_ever_really_retire/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"\"Version 1.65, ~208272 tl;drs so far.\"\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"\"PM's and comments are monitored, constructive feedback is welcome.\"\") | *Top* *keywords*: **economist**^#1 **retirement**^#2 **retire**^#3 **economic**^#4 **work**^#5\"", "metadata": {}}
{"_id": "645", "title": "", "text": "\"Well, the one variable you're forgetting is that we didn't have as much debt hanging over our heads as we do now. As I understand it, maintaining that conflict cost so much money, we're still paying for it today, the better part of a century later. Are you sure that the Federal government should undertake that level of spending again as the Fed is poised to raise rates, reversing a decades long trend of cheap borrowing?  Edit: typo, added \"\"sure\"\"\"", "metadata": {}}
{"_id": "648", "title": "", "text": "It becomes a different game when you allow penny and ultra cheap stocks.  People make much less plays, because the price of the stock doesn't change hardly ever, and when it does change you can end up with people making 10x money over night, and when that happens they sell everything and just camp on their cash till the deadline runs out.  Penny/cheap stocks are fun, but only when you start with very little money, like $5,000, and everyone plays for them.  They are a game breaker when you play the legit market.  The &gt;$2 rule is a default option when you setup a game, it isn't something random I made up.", "metadata": {}}
{"_id": "654", "title": "", "text": "I suppose that is true. If we take me anecdotally, i turn down down boring work. If I have some decent problems to solve, I perform. Payment isn't a factor. Though, I still don't want to take a job that pays less unless it is very interesting.", "metadata": {}}
{"_id": "662", "title": "", "text": "I can only speak to natural gas but I imagine the answer for electricity is the same. In general, yes, it is better to lock into a fixed price contract as in the long run, natural gas prices increase over time.  However, if you locked (signed a fixed price contract) in prior to the economic downturn, most likely you were better off not doing so but the key is long-term. http://en.wikipedia.org/wiki/Natural_gas_prices However, do your research as fixed priced contracts vary considerably from company to company. http://www.energyshop.com/ I think it's a good time to sign a fixed-term contract right now as I don't see prices coming down much further with global economies are now recovering from the downturn. HTH", "metadata": {}}
{"_id": "664", "title": "", "text": "Calling banks 'evil' seems sensationalist. I think it's better to say that their reward-punishment tradeoff is skewed very heavily partly driven by governments being held hostage to fear of bank runs and other doomsday scenarios.  Also, if you think about it, finance has never ever been a clean industry (and I say this as someone whose entire career has been in this industry). Every culture that I know anything about has had issues with the ethics of money lenders throughout history (Middle East, Med. Europe, China, India).", "metadata": {}}
{"_id": "667", "title": "", "text": "Sure, you're happy to trust Page or Zuckerberg to put money to good use. But sometimes bad managers burn through company resources, desperately trying to save their jobs. Great managers with long term visions deserve a long leash, but companies with bad management can sometimes be helped with outside discipline.", "metadata": {}}
{"_id": "680", "title": "", "text": "So one approach would be purely mathematical: look at whichever has the higher interest rate and pay it first. Another approach is to ignore the math (since the interest savings difference between a mortgage and student loan is likely small anyways) and think about what your goals are.  Do you like having a student loan payment?  Would you prefer to get rid of it as quickly as possible?  How would it feel to cut the balance in HALF in one shot? If it were me, I would pay the student loan as fast as possible. Student loans are not cancellable or bankruptable, and once you get it paid off you can put that payment amount toward your house to get it paid off.", "metadata": {}}
{"_id": "687", "title": "", "text": "Why should the rich who buy more expensive homes be subisdized by those who pay less, or from those who rent? A person who buys a 500k home in a high property tax area wins twice. Once but having more tax breaks by being able to deduct more than your average working class person who buys a house at 250k and the second time when they get nicer schools, public services etc at other people's dime. SF home prices are a combination or speculation investment and poor government control. SF prices are at Tokyo levels when the population density is at 1/10. That is a failure of local government policy to build more homes, not from lack of tax breaks.  If your community wants to pay higher taxes for more local services, power to you and I encourage it, but you shouldn't be subsidized by those who dont. Imo, people shouldn't be punished for not owning property or living in a state where they think sales tax is better than income or property.", "metadata": {}}
{"_id": "690", "title": "", "text": "That's not how the world works. That's not how any of this works. They knew he didn't have a degree. You don't get recruited before you graduate because you're a useless expendable. He's going places. And they'll probably pay for him to finish his degree at some point. Either way, he's gonna be rich.", "metadata": {}}
{"_id": "692", "title": "", "text": "If she lives by herself, my guess would be that she qualifies as a household of one. Either way, her monthly income is below the threshold, so she should be eligible. Per the linked website The only way to determine if your household is eligible for SNAP benefits is to apply. I'd say it's worth a try.", "metadata": {}}
{"_id": "703", "title": "", "text": "It's impossible to be definite without knowing the details of your plans, so you should make sure you consult the providers. However there are some general principles: However all that is the general case, and yours might be different. So look up the rules of each plan.", "metadata": {}}
{"_id": "725", "title": "", "text": "Preferred stock is traded on the market, so you can just buy it like any other. The symbol for a preferred stock is the ticker symbol followed by a dash and a letter for each class of preferred stock. Examples: Generally speaking, you should buy Preferred stock with the intention of holding onto it for at least a  couple of years. Often preferred shares are lightly traded and have wide spreads that made it difficult to make money in the short term.", "metadata": {}}
{"_id": "738", "title": "", "text": "Physical addiction also exists, which exists for pot.  I'm sure some car accidents and other accidents have happened, so the drug may not kill you, but the effects can when used in high amounts.   &gt; The reality here is that people like yourself think you know things that you don't know. Pot is safe and very commonly used by lots of different people in a responsible and safe manner.   Like the high driver? LOL. I don't know a smoker that thinks its not ok to drive while being high.  &gt; If you really think pot should be illegal, you should be lobbying for alcohol prohibition too in order to be consistent.  At least with alcohol they have rules of when and where it can be used. Pot smokers will smoke anywhere in your face. They get high and drive, etc... Before you say it doesn't impair you, it does in larger amounts.   there is now a large body of evidence to support the persistence of neurocognitive impairment lasting from hours to weeks. It is important to note that in repeated studies, subjects who reported a marijuana “high” were most likely or most profoundly affected by the drug. This supports the link between THC concentration and neurocognitive dysfunction. Residual effects, however, continued in subjects who no longer felt the drug's effect. Thus, subjective return to baseline mental status may not ensure full return of neurocognitive function.58  https://www.ncbi.nlm.nih.gov/pubmed/12427880  Considerable research into the functional psychomotor and judgment effects of marijuana smoking has been conducted in the context of transportation safety. Research demonstrates that acute cannabis consumption is associated with an increased risk of a motor vehicle crash, and especially for fatal collisions.59  https://www.ncbi.nlm.nih.gov/pubmed/22323502", "metadata": {}}
{"_id": "748", "title": "", "text": "...is investing in a business you believe in a bad strategy?   I'm not saying you're going to be right with your investment (obviously your judgment is coming into play), but you make it sound like it's a terrible way to do things. Is it?", "metadata": {}}
{"_id": "750", "title": "", "text": "Before you even enroll in a good financial school, register for an account with a bank that allows you to manage a stock portfolio.  I prefer TD Ameritrade.  You do have to be 18 (Just register it under your parents, it doesn't matter.  Just make sure they fill out the information portion.  Get the SSN and tax info right.  Basically it's their account, you're just managing it. ) That way you'll have some good, practical experience going into it.  Understand that working with money can be a very cut-throat industry, be ready to be competing with people constantly.    Also, surround yourself with books from successful stock brokers, investment bankers, things like that.  When you're working you'll want information like that.  Good luck, and  I hope this helps.", "metadata": {}}
{"_id": "751", "title": "", "text": "If some one ever offers High returns and low risk they are either extremely stupid or scamming you. If they did find a high return low risk investment a smart person would buy it then repackage it as a low return low risk investment and then sell it to you. People would still buy and they would make a ton.   Either they are lying (scam) or a fool(about as bad)", "metadata": {}}
{"_id": "752", "title": "", "text": "kayaks on sale  --Looking for top fishing kayaks or kayak accessories? Visit paddlerscove.com - your one stop shop featuring an exclusive selection of kayaks for sale, used ocean kayaks, and all related accessories. Get the best bargains on a comprehensive range of premium quality products.", "metadata": {}}
{"_id": "773", "title": "", "text": "For the US government, they've just credited Person B with a Million USD and haven't gained anything (afterall, those digits are intangible and don't really have a value, IMO). Two flaws in this reasoning: The US government didn't do anything. The receiving bank credited the recipient. If the digits are intangible, such that they haven't gained anything, they haven't lost anything either. In practice, the role of governments in the transfer is purely supervisory. The sending bank debits the sender's account and the receiving bank credits the recipient's account. Every intermediary makes some money on this transaction because the cost to the sender exceeds the credit to the recipient. The sending bank typically receives a credit to their account at a correspondent bank. The receiving bank typically receives a debit from their account at a correspondent bank. If a bank sends lots of money, eventually its account at its correspondent will run dry. If a bank receives lots of money, eventually its account at its correspondent will have too much money. This is resolved with domestic payments, sometimes handled by governmental or quasi-governmental agencies. In the US, banks have an account with the federal reserve and adjust balances there. The international component is handled by the correspondent bank(s). They also internally will credit and debit. If they get an imbalance between two currencies they can't easily correct, they will have to sell one currency to buy the other. Fortunately, worldwide currency exchange is extremely efficient.", "metadata": {}}
{"_id": "775", "title": "", "text": "Big topic but I worry much more about who gets debt and who gets subsidies (bailouts) as those are both inefficient and unfair. -- one economist.   Ps. I think the Fed should print $ and distribute per capita rather than do QE, which helps the rich more...", "metadata": {}}
{"_id": "780", "title": "", "text": "Yes, this is common and a perfectly normal use of your ssn#.  The trustees of the estate can get in a lot of trouble with the IRS if they disburse assets to you if you are subject to tax garnishment (i.e. you didn't pay your taxes)", "metadata": {}}
{"_id": "789", "title": "", "text": "&gt;When reading a publication, do you only pay for the pages you read?  No, but many would consider this an innovative and wonderful pricing mechanism.  &gt;It's a package deal, not a rip-off.  Similarly, many consider package deals like cable TV where you get a 1000 channels you don't want to pay for a rip-off.", "metadata": {}}
{"_id": "799", "title": "", "text": "I already said there's no food safety concern. The issue is it's gross. So yes, as I said, it is just my opinion that I think it's icky. That's a perfectly reasonable cause to not eat something. I'm not suggesting it shouldn't be allowed. I'm suggesting it's reasonable that people don't want to eat it.", "metadata": {}}
{"_id": "800", "title": "", "text": "\"A warrant is similar to a call option (the right to buy stock at a certain price), with the difference that warrants are filled by the issuing company with new shares, diluting the existing shareholders' ownership. The language is a bit confusing, but how I interpret it is: So your 9,000 shares will get you 3,000 shares and 3,000 warrants (the right to buy shares at a maximum price of 0.27 between April 2, 2018 and April 30, 2018.   I think the phrase \"\"The subscription price is SEK 0.27 per Unit\"\" means that you can buy each unit for 0.27 SKE (which gets you one share and one option to buy another share.\"", "metadata": {}}
{"_id": "802", "title": "", "text": "It probably doesn't matter since your credit and your checking are at the same institution, but I don't like to let my credit auto draft my checking.  I always do it the other way around (and keep them at different places) I feel like there is more control when my money is gone that way.", "metadata": {}}
{"_id": "803", "title": "", "text": "&gt; hat being said, I don't believe that a group of countries where several still have their royal and noble classes  They're figureheads, period.  &gt; and the economy is a commodity driven market economy.  You're taking Norway and applying it to the rest of the Nordic countries?  I didn't realize all of them had oil.  This goes to show how biased is your perception of them.", "metadata": {}}
{"_id": "815", "title": "", "text": "\"I used to work for one of the three ratings agencies. Awhile ago. First: There are lots of different ratings. The bulk of ratings are for corporate debt and public finance. So senior debentures (fixed income) and General Obligations e.g. tax-free muni bonds, respectively. Ratings agencies are NOT paid by the investment banks, they are paid by the corporations  or city/ state that is issuing debt. The investment banks are the syndicate that pulls the transaction together and brings it to market.  For mortgage-backed securities, collateralized debt CDO-CLO's, all of which are fancy structured securitizations, well, that is a different matter! Those  transactions are the ones where there is an inappropriately close tie between the investment bankers and ratings agencies. And those were the ratings that blew out and caused problems.  Ratings agencies continued to do a decent job with what WAS their traditional business, corporate and municipal bond ratings, as far as I know.   What khajja said was 100% correct: S&amp;P's fees were paid by investors, the people who were purchasing the bonds, until about 50 years ago. Around the same time that McGraw-Hill purchased S&amp;P, in 1966, they departed from that model, and started charging the bond issuers for ratings. I don't know if that decision was driven by McGraw-Hill or not, though.  One more thing: Not all credit ratings agencies are paid by the issuers. One of the 10 NRSRO's (a designation given by the S.E.C.) is Egan-Jones. Their revenue comes from the investors, bond purchasers, not the companies issuing bonds, unlike the S&amp;P/ Fitch/ Moody's \"\"business model\"\". So there is an alternative, which I consider hopeful and reason not to totally despair.  EDIT: What xcrunna19 mentions is also totally accurate. The part about Nouriel Roubini (who is a professor at N.Y.U. or Columbia or such and a sensible though slightly high strung sort) is consistent with my impression. As for whether it would require government action to implement the changes advocated by Roubini, yes, I guess it would, but I don't know if the government would do that. It would be better if the credit ratings agencies would find their own way to a different, less conflicted payment-incentive model.  Keep in mind too that many of the provisions of Dodd-Frank have removed the existing regulatory requirements for credit ratings on bonds and other securities. This is the scary part though: There isn't anything to replace the credit ratings agencies, not at the moment, as far as I can tell! Eventually the government is supposed to come up with an alternative, but that hasn't happened yet. Which is better: Not requiring ratings at all, or the past situation of sometimes inflated ratings, which imparted a false sense of confidence? I don't know.\"", "metadata": {}}
{"_id": "863", "title": "", "text": "And if it costed 50% more they wouldn't either. I bet you a majority of these people just want to save money on gas. I even thought about it, but its too ugly (the back) and the model S is too big for me.", "metadata": {}}
{"_id": "865", "title": "", "text": "&gt; Businesses aren't a charity - they pay for work and exist for profit. They aren't supposed to have feelings. So austerity and getting the most out of your employees causes the company to become lean and efficient.  I agree. That's why I require that my employees sleep at the office so they don't waste time driving back and forth. Much more efficient. Sadly, the Department of Labor disagrees, so its a no go until the lawsuit gets resolved. Goddamn guvermint regulation getting in the way of us job creators.   &gt; Canadians have been becoming more skeptical of Tim Hortons since before the buyout from Burger King and 3G. 3G didn't significantly change the values and product, they cut costs and made it a less cushy environment. The ill will toward Tim Hortons was not caused by 3G, as you suggested.  *cough* http://www.cbc.ca/news/business/tim-hortons-class-action-1.4167739 *cough*.", "metadata": {}}
{"_id": "878", "title": "", "text": "Will there be a scenario in which I want to sell, but nobody wants to buy from me and I'm stuck at the brokerage website? Similarly, if nobody wants to sell their stocks, I will not be able to buy at all? Yes, that is entirely possible.", "metadata": {}}
{"_id": "879", "title": "", "text": "Since you are only 16, you still have time to mature what you will do with your life, always keep your mind opend. If you are really passionated about investement : read 1 book every week about investement, read the website investopedia, financial time, know about macro economic be good a math in school, learning coding and infrastructure can also be interesting since the stock is on server. learn about the history, you can watch on yoube shows about the history of money. learn accounting, the basic at least open a  broker simulating account online ( you will play with a fake wallet but on real value) for 6 month, and after open a broker account with 100 real dollards and plays the penny stocks ( stock under 3 USD a share). after doing all this for 1 year you should know if you want to spend your life doing this and can choose universtity and intership accordingly. You can look on linkedin the profile of investement banker to know what school they attended. Best of luck for your future.", "metadata": {}}
{"_id": "886", "title": "", "text": "I believe this argument is most often used when considering which debts to pay back first, or when there are other options available such as investment options, building up an emergency fund, or saving for a large purchase.  In that case, it's simply justifying making minimum payments and paying more over the life of the loan in exchange for larger liquidity in the present. Unfortunately, when it comes to choosing between which debts to pay (e.g. My mom pays more than the minimum on her car because she can't deduct auto loan interest, despite her mortgage carrying a higher interest rate), it's only beneficial if the tax savings offsets the interest savings difference. The formula for that is: tax bracket > (1 - (target loan interest rate / mortgage interest rate)) That said, most people don't think in the long term, either by natural shortsightedness, or by necessity (need to have an emergency fund).", "metadata": {}}
{"_id": "890", "title": "", "text": "It's called competition. Reddit is funny, they love the electronic revolution when it comes to music, games, TV, piracy, etc. but hate that it will doom bookstores. The sword cuts both ways. Maybe independent bookstores time has come.  (when I say reddit, I am talking in general terms)", "metadata": {}}
{"_id": "902", "title": "", "text": "Name one nation state that has survived more than 20 minutes without taxation.  People won't pay if they don't have to, things don't get built if people don't pay.  Take a holiday to Somalia if you want to see a libertarian paradise in action.", "metadata": {}}
{"_id": "915", "title": "", "text": "I think what's screwing up my calculation is the (reL), return on equity levereged figure. The beta for KORS apparently is -0.58, so when I use the formula reL = rf + (ßL)(rm - rf), I get -0.0048 as my reL.   Am I doing my beta wrong? Am I supposed to use a different figure for my beta?    ALSO, further in the process, when using the formula for WACC, my E/(D+E) is essentially 1.0 because market value of equity for KORS is 7bill and its market value of debt is only like 147 million.  edit: I'm beginning to believe that my beta of -0.58 is not rightly used. It's what yahoo told me, but other sources are saying that the beta of KORS is more like -0.01 or close to 0. Yes?   edit 2: Using -0.01 beta, I get a rdWACC of 2.2%. Now this seems more plausible. I did some research on negative betas and found out that they basically don't really exist aside from gold. So Yahoo must be giving me a weird beta figure. Other websites are all giving me -0.01, so I believe that is correct.", "metadata": {}}
{"_id": "920", "title": "", "text": "\"&gt;  This is horse shit. You're citing liberal propaganda as fact. \"\"Cited as the anti scientist president.\"\" By whom? Just liberals with their dress over their heads.  Did you say \"\"By whom?\"\"??  Have you been living under a rock?  And, even then, do you not know how to google?  Nearly every science oriented magazine and organization has described Trump as anti-science:  1\\.  Scientific American ( https://www.scientificamerican.com/article/trumps-5-most-ldquo-anti-science-rdquo-moves/ )  &gt;  **Trump's 5 Most \"\"Anti-Science\"\" Moves.**   The president-elect has taken what is widely seen as a hostile stance toward the scientific community ...  2\\.  Union of Concerned Scientists ( https://psmag.com/environment/a-brief-survey-of-trumps-assault-on-science )  3\\.  Science ... *the magazine* for the American Association for the Advancement of Science ... the worlds largest general science organization (https://sciencemag.org http://www.sciencemag.org/news/2017/01/what-trumps-nominees-have-said-about-science-their-senate-hearings ,  http://www.sciencemag.org/news/2017/02/hundreds-rally-science-demonstration-near-aaas-meeting , and many others).  And many other news organizations:  4\\.  Worst anti-science president ever.  http://www.newsweek.com/trump-expected-be-most-anti-science-president-ever-519226   5\\.  Trump anti-science policies imperil the world  http://www.scmp.com/business/global-economy/article/2094269/opinion-trumps-anti-science-policies-imperil-world  6\\.  President Trump's War on Science.  https://www.nytimes.com/2017/09/09/opinion/sunday/trump-epa-pruitt-science.html  7\\.  Trump has launched a blitzkrieg in the wars on science   https://www.theguardian.com/environment/climate-consensus-97-per-cent/2017/mar/28/trump-has-launched-a-blitzkrieg-in-the-wars-on-science-and-earths-climate    &gt;  This Nature article is junk, it's just an opinion piece, a few quotes from literally who, and a random bar graph.  That was a news piece, not an opinion piece.  And that doesn't matter anyway.  The result is the graphs which are from the UCLA HERI study.  There was also a Pew Study done in 2009.  http://www.people-press.org/2009/07/09/section-4-scientists-politics-and-religion/  But I don't know why you're arguing ... because you summarized my point (poorly, I may add) with:  &gt;  Trump won on income and was inversely proportional on education.  This was basically my point.  You would know that if you actually read what I wrote.  I say \"\"basically\"\" here, because:  1\\.  You confused \"\"inversely proportional\"\" with negatively correlated ... or proportional with a negative proportionality constant.   Certainly you're aware that \"\"inversely proportional\"\" actually means a relation like y = C 1/x + k.     2\\.  \"\"won on income\"\" is just poor phraseology.  Polls suggest that Trump had a slightly higher edge (2% vs. Hilary) for those whose income was in the higher tiers (most tiers above $50K/yr income).  Polls suggest that he was strongly disfavored for lower incomes.  Of course ... it's best seen in the poll I linked into my first post on this page.  &gt;  Jeez who would have thunk it, lifers post docs are bought it on their liberal academic surroundings. As if that was indicative of intelligence.  Most of your sentences above had poor grammar and, at first, I suspected some advanced Russian bot.  But this is atrocious. Try to express yourself in complete thoughts.  Read what you wrote ... it's complete garbage.  I almost didn't respond at all since it doesn't deserve a response.\"", "metadata": {}}
{"_id": "933", "title": "", "text": "Vikasmarg.com offers huge list of products and services to avail as well as buy. The portal is very user-friendly and anyone can use it easily. Free classified ads section has made us the most popular portal on the web. Post free classified ads in variety of listings such as office supplies, event management, house cleaning, tours and travels, coaching as well as training, vehicles and so on.", "metadata": {}}
{"_id": "958", "title": "", "text": "\"&gt;I am not forgetting anything. You don't seem to get a broadcasting is media and part of media. Like I said they are a media company. No different from saying Time Warner is a media company or Disney.   It's dishonest to equate a purely digital media entity to a broadcaster. Completely different tier—just not favorable to your argument.  &gt;Have you actually visited their website? It has such stories such as \"\"Turns Out It's Totally Cool to Have a 20-Pound Lobster in Your Suitcase\"\" and \"\"The Mothers Haunted by Their Sons' Unsolved Murders\"\" as well as \"\"D.R.A.M. Opens Up About Being a 'Big Baby' on 'THE THERAPIST'\"\" and \"\"New Yorkers Love Pride, Hate Trump\"\". Really no different from Buzzfeed except Vice doesn't do the whole list thing.   So, history time: Vice Magazine established a channel called Viceland.com, and later it established other channels on VBS.tv. Eventually, they combined into a combined channel called vice.com, including the following sub-channels:  * Vice  * Broadly.  * Creators  * i-D  * Amuse  * Motherboard  * Munchies  * Noisey  * Tonic  * Thump  * Vice Impact  * Vice Sports  * Waypoint  * Viceland  * Vice News  So, you are viewing content from all those channels combined together, mistaking it for all Vice News content. BTW, the best Vice News content gets put into their HBO programs. Vice the series is phenomenal!   &gt;Nope, as it is not faulty. You can claim it is all you want, but until you prove its faulty its not. And you yet to prove its actually faulty.   It's a sweeping generalization. The argument does not stand up to scrutiny, and that is proof it is faulty. Look up what a sweeping generalization is.  &gt;One I told you I read the article and it was crap, you even agreed with me it was crap. Two media companies do screen what content is on their platform. Meaning if they are smart they check for the quality of content as well. Thirdly didn't I tell you like 3 times now to stop making leaping assumptions and bullshit claims? Yet you continue to do so. And for someone claiming to have good analytic skills you certainly fall short in them.  Yeah, okay, I think this is the point that I refrain from rubbing your nose in not just your logical mistake, again, but also your mistake about the type of stories on Vice News. Also, for tech news, I will give Motherboard a nod as well. There's also some pretty good content from Viceland (Specifically, I enjoy Hamilton's Pharmacopeia).\"", "metadata": {}}
{"_id": "962", "title": "", "text": "\"If the value of these hard assets is significant you probably have them insured, and for significant art work you should have had them appraised as part of getting them insured. Therefore the process of adding them into the net worth calculation would be trivial.  Your goals should be a mix of liquid assets, and assets that are harder to sell, such as real estate. It should also include those items you are more reluctant to sell. In some cases these \"\"investments\"\" do need to be included in official calculations, such as applying for a student loan or financial aid, required financial disclosure statements for some government jobs, or applications for government assistance.\"", "metadata": {}}
{"_id": "984", "title": "", "text": "That is your bill because the services were performed for you.   You still can negotiate with the doctor however.  Suggest that while you aren't willing to pay the full share, you will pay the negotiated amount he would have actually gotten from the insurance company (or some fraction thereof).  Doc did make a mistake, but you are very much liable for it.", "metadata": {}}
{"_id": "985", "title": "", "text": "Definitely, check if they are regulated by the Finnish financial regulatory board. Google FIN-FSA regulation. It can also be that they are regulated off-shore, no matter just find it out. Besides try to find the terms of you're contract, if cant find ask the broker to point out. Wonder what will happen, following this thread", "metadata": {}}
{"_id": "991", "title": "", "text": "\"The question asked in your last paragraph (what's the downside) is answered simply; if you take out a loan and close the cards, that's a ding on your score because your leverage ratio on this portion of your credit jumps to 100% or more, and because you'll be reducing the average age of your lines of credit (one line of credit a few days old versus five lines of credit several years old each). If you take out the loan and don't close the accounts, it's one more line of credit, increasing your total credit, lowering your leverage, but making institutions more reluctant to give you any more credit until they see what you'll do with what you have. In either case, assuming you can get the loan at less than the average rate of the cards (that's actually not a guarantee; a lot of lenders will want APRs in the 20s or 30s even for a title loan or other collateralized loan), then your cost of capital will also go down. That gives you more of a gap of discretionary income that you can better use to \"\"snowball\"\" all this debt as you are planning. Another thing to keep in mind is that the minimum payment changes as the balance does. The minimum payment covers monthly interest at least, and therefore varies based on your interest rate (usually variable) and your balance (which will hopefully be decreasing). A constant payment over the current minimum, much like a more traditional amortization, would be preferable.\"", "metadata": {}}
{"_id": "994", "title": "", "text": "\"I could keep a couple of cows fed for weeks with all that straw.   But seriously, we could come up with hypotheticals all day about why we should do nothing.  \"\"I've got mine!\"\" is cheap and feels good to say. But like anything else that's cheap and feels good, gently tutting at the life choices of imaginary millennials will only hurt us if we do it too much.   The fact is that our education system and work system cannot or will not handle the large number of Americans. They therefore cannot participate in the economy, and the only ones who will hurt from this in the end will be America as a whole. It's our responsibility as a group to find a solution, and that includes Americans of all means.   We could also of course move in with our fiscal drug dealer and have China prop up our economy. That will come with all sorts of nasty costs which I don't think we're prepared to pay for.\"", "metadata": {}}
{"_id": "995", "title": "", "text": "\"So I guess Morgan &amp; Stanley was talking out of its ass when it was like all \"\"Buy Buy Buy\"\"  So I guess Morgan &amp; Stanley must have quite a nice exposure, since they won't be selling since nobody is buying huh?  Leverage baby?\"", "metadata": {}}
{"_id": "996", "title": "", "text": "Bitcoin is backed by math and the ability to exist in a trustless state. That has value. I don't need to care about double spends, or worry about Quantative Easing. That has value. I can push transactions at my leisure over the network, sending money worldwide without needing a third party. That has value.   Soon, higher level solutions will be implemented, allowing cheap microtransactions between users, and giving the network a vast scaling boost. That has value.  You are stuck in a rut, from what I gather from your comments in this thread. You don't perceive the value of Bitcoin, because in your paradigm value is inherently coupled to companies and their revenue. Bitcoin is the paradigm shift that allows money to be decoupled from third parties.", "metadata": {}}
{"_id": "1001", "title": "", "text": "\"Not necessarily.  The abbreviation \"\"ESOP\"\" is ambiguous.  There are at least 8 variations I know of: You'll find references on Google to each of those, some more than others.  For fun you can even substitute the word \"\"Executive\"\" for \"\"Employee\"\" and I'm sure you'll find more.  Really. So you may be mistaken about the \"\"O\"\" referring to \"\"options\"\" and thereby implying it must be about options.  Or, you may be right.  If you participate in such a plan (or program) then check the documentation and then you'll know what it stands for, and how it works.  That being said: companies can have either kind of incentive plan: one that issues stock, or one that issues options, with the intent to eventually issue stock in exchange for the option exercise price. When options are issued, they usually do have an expiration date by which you need to exercise if you want to buy the shares. There may be other conditions attached. For instance, whether the plan is about stocks or options, often there is a vesting schedule that determines when you become eligible to buy or exercise. When you buy the shares, they may be registered directly in your name (you might get a fancy certificate), or they may be deposited in an account in your name. If the company is small and private, the former may be the case, and if public, the latter may be the case. Details vary. Check the plan's documentation and/or with its administrators.\"", "metadata": {}}
{"_id": "1011", "title": "", "text": "\"You will be filing the exact same form you've been filing until now (I hope...) which is called form 1040. Attached to it, you'll add a \"\"Schedule C\"\" form and \"\"Schedule SE\"\" form. Keep in mind the potential effect of the tax and totalization treaties the US has with the UK which may affect your filings. I suggest you talk to a licensed EA/CPA who works with expats in the UK and is familiar with all the issues. There are several prominent offices you can find by Googling.\"", "metadata": {}}
{"_id": "1034", "title": "", "text": "\"What you are describing is a very specific case of the more general principle of how dividend payments work. Broadly speaking, if you own common shares in a corporation, you are a part owner of that corporation; you have the right to a % of all of that corporation's assets. The value in having that right is ultimately because the corporation will pay you dividends while it operates, and perhaps a final dividend when it liquidates at the end of its life. This is why your shares have value - because they give you ownership of the business itself. Now, assume you own 1k shares in a company with 100M shares, worth a total of $5B. You own 0.001% of the company, and each of your shares is worth $50; the total value of all your shares is $50k. Assume further that the value of the company includes $1B in cash. If the company pays out a dividend of $1B, it will now be only worth $4B. Your shares have just gone down in value by 20%! But, you have a right to 0.001% of the dividend, which equals a $10k cash payment to you. Your personal holdings are now $40k worth of shares, plus $10k in cash. Except for taxes, financial theory states that whether a corporation pays a dividend or not should not impact the value to the individual shareholder.  The difference between a regular corporation and a mutual fund, is that the mutual fund is actually a pool of various investments, and it reports a breakdown of that pool to you in a different way. If you own shares directly in a corporation, the dividends you receive are called 'dividends', even if you bought them 1 minute before the ex-dividend date. But a payment from a mutual fund can be divided between, for example, a flow through of dividends, interest, or a return of capital. If you 'looked inside' your mutual fund you when you bought it, you would see that 40% of its value comes from stock A, 20% comes from stock B, etc etc., including maybe 1% of the value coming from a pile of cash the fund owns at the time you bought your units.  In theory the mutual fund could set aside the cash it holds for current owners only, but then it would need to track everyone's cash-ownership on an individual basis, and there would be thousands of different 'unit classes' based on timing. For simplicity, the mutual fund just says \"\"yes, when you bought $50k in units, we were 1/3 of the year towards paying out a $10k dividend. So of that $10k dividend, $3,333k of it is assumed to have been cash at the time you bought your shares. Instead of being an actual 'dividend', it is simply a return of capital.\"\"  By doing this, the mutual fund is able to pay you your owed dividend [otherwise you would still have the same number of units but no cash, meaning you would lose overall value], without forcing you to be taxed on that payment. If the mutual fund didn't do this separate reporting, you would have paid $50k to buy $46,667k of shares and $3,333k of cash, and then you would have paid tax on that cash when it was returned to you. Note that this does not \"\"falsely exaggerate the investment return\"\", because a return of capital is not earnings; that's why it is reported separately.  Note that a 'close-ended fund' is not a mutual fund, it is actually a single corporation. You own units in a mutual fund, giving you the rights to a proportion of all the fund's various investments. You own shares in a close-ended fund, just as you would own shares in any other corporation. The mutual fund passes along the interest, dividends, etc. from its investments on to you; the close-ended fund may pay dividends directly to its shareholders, based on its own internal dividend policy.\"", "metadata": {}}
